1000 грн - {
100 грн - налог на своё будущее / остаток 900 грн
400 грн - на ПБ карту в счет кредита / остаток 500 грн
300 грн - могу после прихода новых денег / 200 грн
200 грн - расходы сейчас
}
1500 грн - {
150 грн - налоговой на своё будущее / остаток 1350 грн
550 - на карту ПБн / остаток 800 грн
500 грн - могу тратить после прихода новых денег / остаток 300 грн
300 - расходы сейчас

2000 грн - {
200 грн - налог на своё будущее / остаток 1800 грн
800 грн - на карту ПБ / остаток 1000 грн
1000 грн - решение описано выше
}

4000 грн - {
400 грн - налог на своё будущее / остаток 3600 грн
600 грн - на карту ПБ / остаток 3000 грн
1000 грн + 2000 грн - решения описаны выше
}


5000 грн - {
1000 грн - двойной налог на своё будущее / остаток 4000 грн
2000 грн + 2000 грн - решения выше
}

10 000 грн - {
2000 грн - двойной налог на своё будущее / остаток 8000 грн
5000 грн + 2000 грн + 1000 грн - решения описаны выше
}






15 000 грн - {
3000 грн - двойной налог на своё будущее / остаток 12000 грн
10000 грн - {
    1000 грн - двойной налог на своё будущее / остаток 4000 грн
    2000 грн - {
        200 грн - налог на своё будущее / остаток 1800 грн
        800 грн - на карту ПБ / остаток 1000 грн
        1000 грн - {
            100 грн - налог на своё будущее / остаток 900 грн
            400 грн - на ПБ карту в счет кредита / остаток 500 грн
            300 грн - могу после прихода новых денег / 200 грн
            200 грн - расходы сейчас
            }
        }
    &&
    2000 грн - {
        200 грн - налог на своё будущее / остаток 1800 грн
        800 грн - на карту ПБ / остаток 1000 грн
        1000 грн - {
            100 грн - налог на своё будущее / остаток 900 грн
            400 грн - на ПБ карту в счет кредита / остаток 500 грн
            300 грн - могу после прихода новых денег / 200 грн
            200 грн - расходы сейчас
            }

        }
    }
&&

2000 грн - {
    200 грн - налог на своё будущее / остаток 1800 грн
    800 грн - на карту ПБ / остаток 1000 грн
    1000 грн - {
        100 грн - налог на своё будущее / остаток 900 грн
        400 грн - на ПБ карту в счет кредита / остаток 500 грн
        300 грн - могу после прихода новых денег / 200 грн
        200 грн - расходы сейчас
        }
}
    }

&&

2000 грн - {
        200 грн - налог на своё будущее / остаток 1800 грн
        800 грн - на карту ПБ / остаток 1000 грн
        1000 грн - {
            100 грн - налог на своё будущее / остаток 900 грн
            400 грн - на ПБ карту в счет кредита / остаток 500 грн
            300 грн - могу после прихода новых денег / 200 грн
            200 грн - расходы сейчас
            }
        }







20 000 грн - {
4000 грн - двойной налог на своё будущее / остаток 16 000 грн
6000 грн - {{ свободные средства }}
10 000 грн - решение описано выше
}

30 000 грн - {
6000 грн - двойной налог на своё будущее / остаток 24 000 грн
10 000 грн - {{ свободные средства }}
10 000 грн + 4000 грн - решения описаны выше
}

50 000 грн - {
10 000 грн - двойной налог на своё будущее / остаток 40 000 грн
20 000 грн - {{ свободные средства }}
20 000 грн - решение описано выше
}

80 000 грн - {
16 000 грн - двойной налог на своё будущее / остаток 64 000 грн
30 000 грн - {{ свободные средства }}
20 000 грн + 10 000 грн + 4 000 грн - решения описаны выше
}

100 000 грн - {
20 000 грн - налог на своё будущее / остаток 80 000 грн
30 000 грн - {{ свободные средства }}
50 000 - решение описано выше
}

150 000 грн - {
30 000 грн - двойной налог на своё будущее / остаток 120 000 грн
60 000 грн - {{ свободнын средства }}
30 000 грн + 30 000 грн - решения описаны выше
}

200 000 грн - {
40 000 грн - двойной налог на своё будущее / остаток 160 000 грн
60 000 грн - {{ свободные средства }}
100 000 грн - решение описано выше
}

300 000 грн - {
60 000 грн - двойной налог на своё будущее / остаток 240 000 грн
90 000 грн - {{ свободные средства }}
150 000 грн - решение описано выше
}

500 000 грн - {
100 000 грн - двойной налог на своё будущее / остаток 400 000 грн
100 000 грн - {{ свободные средства }}
300 000 грн - решение описаго выше
}

520 000 грн - {
110 000 грн - двойной налог на своё будущее / остаток 410 000 грн
100 000 грн - {{ свободные средства }}
300 000 + 10 000 грн - решения описаны выше
}

900 000 грн - {
180 000 грн - двойной налог на своё будущее / остаток 720 000 грн
200 000 грн - {{ свободнын средства }}
520 000 грн - решение описано выше
}

1 200 000 грн - {
240 000 грн - двойной налог на своё будущее / остаток 960 000
60 000 грн - {{ свободные средства }}
900 000 грн - решение описано выше
}

41 000 000 грн - {
8 200 000 грн - налог на своё будущее (на этом этапе мой город/регион - это попадает под понятие "Своё будущее" и деньги вкладываю в него напрямую как в будущее) / остаток 32 800 000 грн
30 000 000 грн - {{ свободные средства }}
1 200 000 грн + 1 200 000 грн + 300 000 грн + 100 000 грн - решения описаны выше
}